<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Ausgaben kontrollieren</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt;
<h1>Ausgaben kontrollieren</h1>
<p>Sobald Sie Ihren <a href="../generalPlanning/index.html">Allgemeinen Plan</a> erstellt haben, k&ouml;nnen Sie Ihre
monatlichen Einnahmen und Ausgaben nachverfolgen und kontrollieren. Von nun an werden Sie haupts&auml;chlich diese 
Aufgaben innerhalb <em>RsBudget</em> durchf&uuml;hren: neue Buchungen eingeben, Planwerte ver&auml;ndern und finanzielle Aktivit&auml;ten
kontrollieren.</p> 
<p>Sie k&ouml;nnen eine Buchung oder ein Budget jederzeit ver&auml;ndern, ohne andere Monate oder den Allgemeinen Plan
zu beeinflussen. Die &Auml;nderungen wirken sich nur lokal auf den jeweiligen Monat aus. Dieser Artikel erkl&auml;rt, wie
Sie Ihre Einnahmen und Ausgaben nachverfolgen.</p>
<p><a href="../../images/de/views-monthly.png"><img class="screenshot" border="no" src="../../images/de/views-monthly.png" width="500"/></a></p>
<p><a href="../views/monthly-planning.html">Eine vollst&auml;ndige Beschreibung der Ansicht findet sich hier.</a></p>

<h2 id="createplan">Den Monatsplan erzeugen</h2>
<p>Navigieren Sie zun&auml;chst zu dem gew&uuml;nschten Monat (der aktuelle Monat ist automatisch ausgew&auml;hlt, wenn
Sie <em>RsBudget</em> starten). Erzeugen Sie den Monatsplan, indem Sie auf die Schaltfl&auml;che
<img src="../../images/money--plus.png"/> in der Werkzeugleiste klicken. Das System wertet nun den 
<a href="../generalPlanning/index.html">Allgemeinen Plan</a> aus und erzeugt alle Buchungen und Budgets, die f&uuml;r
diesen Monat geplant wurden. Die <a href="../views/monthly-planning.html#summary">&Uuml;bersicht</a> zeigt Ihnen
sodann die Basisdaten Ihrer Planung an, sofern die Buchungen wie geplant erfolgen.</p>

<h2 id="setopeningstatus">Den Monat er&ouml;ffnen</h2>
<p>Der n&auml;chste Schritt ist, <em>RsBudget</em> mitzuteilen, wie der Er&ouml;ffnungssaldo ausf&auml;llt. Dieser
Wert ist individuell f&uuml;r jeden Monat definiert. Das hei&szlig;t auch, dass dieser nicht zwangsl&auml;ufig
mit dem Schluss-Saldo des Vormonats &uuml;bereinstimmen muss. Sinnvollerweise sollten aber beide gleich sein.
Der Er&ouml;ffnungs-Saldo ist der Wert, der in der <a href="../views/history.html">Historie</a> angezeigt wird.</p>

<p>Sie setzen den Saldo durch Klicken auf die Schaltfl&auml;che <img src="../../images/book-brown.png"/> in der
Werkzeugleiste der Ansicht. Der erscheinende Dialog pr&uuml;ft alle m&ouml;glichen Optionen und schl&auml;gt einige
der Optionen vor. W&auml;hlen Sie einen Wert aus, oder geben Sie den Wert manuell ein. Achten Sie bitte darauf,
dass Sie den Wert auf der <b>linken</b> Seite des Dialogs festlegen. Die rechte Seite ist f&uuml;r den Schluss-Saldo
reserviert.</p>

<h2 id="tracking">Einnahmen und Ausgaben kontrollieren</h2>
<p>Sie k&ouml;nnen nun Ihre Einnahmen und Ausgaben nachverfolgen. Erzeugen Sie dazu Einzel-Buchungen oder Budgets,
geben Sie die Ist-Werte von geplanten Buchungen und deren Buchungsdatum ein. Das System wird die &Auml;nderungen
mit einer aktualisierten Gewinn- und Verlustrechnung in der &Uuml;bersicht quittieren. Weitere Details zu den
m&ouml;glichen Aktionen, die Sie auf dem Monatsplan durchf&uuml;hren k&ouml;nnen, entnehmen Sie bitte der   
<a href="../views/monthly-planning.html#tasks">entsprechenden Hilfeseite</a>.</p>

<p>Es ist im &Uuml;brigen m&ouml;glich, die Zuweisung von Budgets und Kategorien zu vereinfachen, in dem man
entsprechende Regeln definiert. Einzelheiten dazu entnehmen Sie bitte der Hilfe zum 
<a href="../settings/rules.html">Einstellungs-Dialog</a>.</p> 

<h2 id="closing">Den Monat abschlie&szlig;en</h2>
<p>Nachdem die letzte Buchung f&uuml;r einen Monat eingetragen wurde, muss der Monat noch finanziell abgeschlossen werden.
Der letzte Schritt ist daher, den Schluss-Saldo festzulegen. Dieser Wert definiert zusammen mit dem Er&ouml;ffnungs-Saldo
den Gewinn/Verlust f&uuml;r den jeweiligen Monat. Er wird separat gespeichert, so dass keine Notwendigkeit besteht,
dass er logisch zu den Transaktionen passt (er kann vom eigentlichen Saldo abweichen). Nat&uuml;rlich ist es sinnvoller,
einen der Vorschl&auml;ge von <em>RsBudget</em> anzunehmen, wenn man den Schluss-Saldo festlegt. Klicken Sie erneut auf die 
Schaltfl&auml;che <img src="../../images/book-brown.png"/> und setzen Sie den Wert auf der <b>rechten</b> Seite des Dialogs.</p>

<p>Geschafft! Sie haben Ihre Finanzen erfolgreich f&uuml;r diesen Monat verfolgt und kontrolliert. Nun ist es Zeit, von vorne
anzufangen: mit dem n&auml;chsten Monat.</p>
</body>
</html>