<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Datensicherheit und Datenschutz</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt;
<h1>Datensicherheit und Datenschutz</h1>
<p><em>RsBudget</em> sch&uuml;tzt und respektiert die Privatsph&auml;re Ihrer Daten. Deshalb werden keinerlei
pers&ouml;nliche Daten von Ihrem Rechner &uuml;bertragen. Die Software-Aktualisierung erfolgt anonym und wird
nicht auotmatisiert durchgef&uuml;hrt. Auf diese Weise kontrollieren Sie selbst, wann <em>RsBudget</em> den
Update-Server kontaktieren soll. Ebenso werden dabei keine pers&ouml;nlichen Daten &uuml;bertragen.</p>
<p>Die Anwendung selbst ist durch ein pers&ouml;nliches Passwort gesch&uuml;tzt. Dieses wird nirgends auf
Ihrer Computer gespeichert. Das Passwort k&ouml;nnen Sie jederzeit &auml;ndern.</p>
<p>Ihre pers&ouml;nlichen Daten weren in einer Datenbank auf Ihrem Rechner gespeichert (es sei denn, Sie haben
eine entfernte Datenbank konfiguriert). Sie k&ouml;nnen selbst bestimmen, ob diese Daten verschl&uuml;sselt
abgelegt werden oder nicht. Solange niemand Ihre Datenbank-Zugangsdaten stiehlt oder anderweitig Zugang zur
Datenbank erlangt, sind Ihre Daten dort sicher und k&ouml;nnen nicht ausgelesen werden.</p>
<p>Sie sollten sich jedoch dar&uuml;ber bewusst sein, dass Ihre Daten - wie bei jeglicher Software - nur so 
lange sicher sind, so lange Sie Ihren Computer entsprechend sch&uuml;tzen. Daher hier einige Hinweise, wie Sie
Ihren Computer und Ihre Daten sch&uuml;tzen k&ouml;nnen:</p>
<ul>
	<li>Seien Sie vorsichtig, wenn Sie unbekannte Webseiten besuchen, da diese Ihren PC mit Malware oder
	    einem Virus infizieren k&ouml;nnen. Antivirensoftware gew&auml;hrleistet keinen 100-prozentigen Schutz,
	    denn:<ul>
		<li>Sie k&ouml;nnte die Schadsoftware nicht kennen, mit der Ihr PC infiziert ist.</li>
		<li>Sie k&ouml;nnte nicht auf dem aktuellsten Stand sein.</li>
		<li>Sie wiegt Sie in falscher Sicherheit und macht Sie unvorsichtig.</li>
	</ul></li>
	<li>Deaktivieren Sie die automatische Anzeige von Bildern in Ihrem E-Mail-Programm.</li>
	<li>Klicken Sie niemals auf Links in E-Mails von unbekannten Absendern (oder selbst von bekannten Absendern),
	    es sei denn, Sie wissen genau, was Sie tun.</li>
	<li>Seien Sie vorsichtig, wenn Sie fremde USB-Sticks oder -Laufwerke benutzen wollen. Deaktivieren Sie die
	    Auto-Start-Funktion an Ihrem Rechner.</li>
	<li>Benutzen Sie Passw&ouml;rter nur einmal. Angreifer k&ouml;nnen so ein einmal gestohlenes Passwort nicht
	    an anderer Stelle verwenden. (Generieren Sie Passw&ouml;rter mit einem einfach zu merkenden, aber schwer
	    zu erratenden Muster).</li>
	<li>Seien Sie beim Eingeben von Passw&ouml;rtern vorsichtig, dass Sie niemand dabei beobachtet.</li>
	<li>Installieren Sie keine unbekannte Software. Recherchieren Sie die Seri&ouml;sit&auml;t der Software, bevor
	    Sie sie installieren.</li>
	<li>Schreiben Sie Ihre Passw&ouml;rter niemals auf, weder auf Papier noch in elektronische Dateien.</li>
</ul>

</body>
</html>