<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Allgemeine Planung</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt; <a href="index.html">Ansichten</a> &gt; 
<h1>Allgemeine Planung</h1>
Diese Ansicht stellt die Allgemeine Planung zur Verf&uuml;gung.
<p><a href="../../images/de/views-general.png"><img class="screenshot" border="no" src="../../images/de/views-general.png" width="500"/></a></p>

<h2 id="information">View-Beschreibung</h2>
<p>Die Ansicht ist vertikal in zwei Teile unterteilt. Der obere Teil ist die <em>Plan-&Uuml;bersicht</em>. Sie zeigt Basiswerte Ihrer
Allgemeinen Budgetplanung. Der untere Teil zeigt die Buchungen und Budgets f&uuml;r die jeweiligen Zyklen an.</p>

<h3 id="summary">Die Plan-&Uuml;bersicht</h3>
<p>Dieser Teil fasst Ihre Planung zusammen, so dass Sie Ihre finanzielle Gesundheit einsch&auml;tzen k&ouml;nnen.</p>
<table>
	<tr>
		<th>Wert</th>
		<th>Beschreibung</th>
	<tr>
	<tr>
		<td>Monatliche Einnahmen</td>
		<td>Die Summe der monatlichen Einnahmen</td>
	</tr>
	<tr>
		<td>Monatliche Ausgaben</td>
		<td>Die Summe der monatlichen Ausgaben</td>
	</tr>
	<tr>
		<td>Monatlicher G/V</td>
		<td>Der Gewinn/Verlust der Buchungen pro Monat</td>
	</tr>
	<tr>
		<td>J&auml;hrliche Einnahmen</td>
		<td>Die Summe aller Einnahmen pro Jahr</td>
	</tr>
	<tr>
		<td>J&auml;hrliche Ausgaben</td>
		<td>Die Summe aller Ausgaben pro Jahr</td>
	</tr>
	<tr>
		<td>J&auml;hrlicher G/V</td>
		<td>Der Gesamt-Gewinn/Verlust pro Jahr</td>
	</tr>
	<tr>
		<td>Durchschnitt Einnahmen/Monat</td>
		<td>Das durchschnittliche, monatliche Einkommen. Dieser Wert gleicht unterschiedliche Einnahmen 
		    in verschiedenen Monaten aus.</td>
	</tr>
	<tr>
		<td>Durchschnitt Ausgaben/Monat</td>
		<td>Die durchschnittlichen, monatlichen Ausgaben. Dieser Wert gleicht unterschiedliche Ausgaben 
		    in verschiedenen Monaten aus.</td>
	</tr>
	<tr>
		<td>Durchschnitt G/V</td>
		<td>Der durchschnittliche Gewinn/Verlust pro Monat. Dieser Wert gleicht die unterschiedlichen
		    Einnahmen und Ausgaben in verschiedenen Monaten aus.</td>
	</tr>
</table>

<h3 id="plan">Die Buchungstabelle</h3>
<p>Die Buchungstabelle zeigt alle geplanten Buchungen und Budgets. Ein t&uuml;rkiser Hintergrund hebt Budgets hervor.
Ein wei&szlig;er Hintergrund kennzeichnet einzelne Buchungen. Die folgende Tabelle beschreibt die verschiedenen Werte
in den jeweiligen Spalten.</p>
<table>
	<tr>
		<th>Spalte</th>
		<th>Beschreibung</th>
	<tr>
	<tr>
		<td>Zyklus</td>
		<td>Der Zyklus, in dem diese Buchung auftritt (monatlich, alle 2 Monate, viertelj&auml;hrlich, halbj&auml;hrlich, j&auml;hrlich)</td>
	</tr>
	<tr>
		<td>Sequenz</td>
		<td>Die Monate, in denen diese Buchung geplant ist (leer bei monatlichen Buchungen).</td>
	</tr>
	<tr>
		<td>Text</td>
		<td>Der Buchungstext</td>
	</tr>
	<tr>
		<td>Details</td>
		<td>Details und Hinweise zu dieser Buchung, z.B. Herkunft oder Referenz (optional).</td>
	</tr>
	<tr>
		<td>Budget</td>
		<td>Das Budget, zu dem diese Buchung geh&ouml;rt (optional).</td>
	</tr>
	<tr>
		<td>Kategorie</td>
		<td>Die Kategorie, die dieser Buchung zugeordnet ist.</td>
	</tr>
	<tr>
		<td>Wert</td>
		<td>Der geplante Wert dieser Transaktion. Positive Zahlen kennzeichnen Einkommen, negative Zahlen kennzeichnen
		    Ausgaben. Der Wert ist gem&auml;&szlig; den <a href="../settings/colors.html">Farb-Einstellungen</a>
		    koloriert.</td>
	</tr>
</table>

<h2 id="tasks">Aufgaben</h2>
<h3 id="createtx">Eine neue Buchung anlegen</h3>
<p>Erzeugen Sie eine neue Buchung, indem Sie</p>
<ul>
	<li>mit der rechten Maustaste auf die Tabelle klicken. W&auml;hlen Sie "Neue Buchung" aus dem Kontextmen&uuml;.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-insert-row.png"/> direkt &uuml;ber der Buchungstabelle.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-insert-row.png"/> in der Werkzeugleiste der Ansicht.</li>
	<li>Dr&uuml;cken Sie die <code>Einf&uuml;gen</code>-Taste</li>
</ul>
<p>Alle Methoden erzeugen eine neue Buchung am Ende der Tabelle und scrollen dorthin, falls notwendig. Die Textmarke (Cursor) ist bereits
im Feld f&uuml;r den Buchungstext platziert, so dass Sie sofort anfangen k&ouml;nnen, Ihren Text einzugeben.</p>

<h3 id="modifytx">Eine Buchung bearbeiten</h3>
<p>Doppelklicken Sie in der Tabelle auf den Wert, den Sie bearbeiten m&ouml;chten. Je nach Spalte erscheint ein Auswahlfeld, aus dem Sie
den neuen Wert selektieren k&ouml;nnen, bzw. ein Textfeld, mit dem Sie den Text &auml;ndern k&ouml;nnen. Dr&uuml;cken Sie <code>Enter</code>,
wenn Sie Ihre Eingabe beendet haben bzw. klicken Sie mit der Maus auf eine beliebige Stelle au&szlig;erhalb des Eingabefeldes. Ihre
&Auml;nderung wird sofort abgespeichert.</p>
<p>Sie k&ouml;nnen das Editieren abbrechen, wenn Sie <code>Esc</code> auf Ihrer Tastatur dr&uuml;cken. Ihr &Auml;nderung wird dann nicht abgespeichert.</p>

<h3 id="movetx">Eine Buchung verschieben</h3>
<p>Es ist m&ouml;glich, die Reihenfolge der Buchungen zu &auml;ndern. Klicken Sie dazu mit der rechten Maustaste auf die Tabelle und
w&auml;hlen Sie "Nach oben" bzw. "Nach unten", um die ausgew&auml;hlte Buchung zu verschieben. Dieselbe Aktion k&ouml;nnen Sie
auch &uuml;ber die Tastenkombinationen <code>Strg+&uarr;</code> und <code>Strg+&darr;</code> ausl&ouml;sen.</p>

<h3 id="transformtx">Buchungen in Budgets umwandeln</h3>
<p>Transaktionen k&ouml;nnen in Buchungen und umgekehrt umgewandelt werden. Klicken Sie dazu mit der rechten Maustaste auf die entsprechende
Zeile und w&auml;hlen Sie "In Budget umwandeln" bzw. "In Buchung umwandeln".</p>

<h3 id="deletetx">Eine Buchung l&ouml;schen</h3>
<p>Nat&uuml;rlich k&ouml;nnen Sie Buchungen und Budgets aus der Tabelle auch wieder l&ouml;schen:</p>
<ul>
	<li>mit der rechten Maustaste auf die Tabelle klicken. W&auml;hlen Sie "Buchung l&ouml;schen" aus dem Kontextmen&uuml;.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-delete-row.png"/> direkt &uuml;ber der Buchungstabelle.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-delete-row.png"/> in der Werkzeugleiste der Ansicht.</li>
	<li>Dr&uuml;cken Sie die <code>Entfernen</code>-Taste</li>
</ul>
<p><em>RsBudget</em> wird Sie nach einer Best&auml;tigung fragen, bevor die ausgew&auml;hlte Zeile gel&ouml;scht wird.</p>

</body>
</html>