<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Monatliche Planung</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt; <a href="index.html">Ansichten</a> &gt; 
<h1>Monatliche Planung</h1>
<p>Diese Ansicht wird verwendet, um die monatlichen, finanziellen Aktivit&auml;ten zu planen, nachzuverfolgen und
zu kontrollieren.</p>

<p><a href="../../images/de/views-monthly.png"><img class="screenshot" border="no" src="../../images/de/views-monthly.png" width="500"/></a></p>

<h2 id="information">View-Beschreibung</h2>
<p>Die Ansicht ist vertikal in zwei Teile unterteilt. Der obere Teil ist die <em>Plan-&Uuml;bersicht</em>. Er zeigt die
Navigationselemente zur Monatsauswahl und die Basiswerte Ihrer Planung an. Der untere Teil enth&auml;lt die geplanten
und get&auml;tigten Transaktionen des ausgew&auml;hlten Monats.</p>

<h3 id="summary">Die Plan-&Uuml;bersicht</h3>
<p>Dieser Teil fasst Ihre Planung zusammen, so dass Sie den finanziellen Status des ausgew&auml;hlten Monats sehen k&ouml;nnen.</p>
<table>
	<tr>
		<th>Wert</th>
		<th>Beschreibung</th>
	<tr>
	<tr>
		<td>Saldo am &lt;Monatsersten&gt;</td>
		<td>Der Er&ouml;ffnungs-Saldo des Monats</td>
	</tr>
	<tr>
		<td>Aktueller Saldo</td>
		<td>Der aktuelle Saldo, der <em>RsBudget</em> bekannt ist.</td>
	</tr>
	<tr>
		<td>Saldo am &lt;Monatsletzten&gt;</td>
		<td>Der Schluss-Saldo des Monats. Solange der Monat nicht abgeschlossen ist (siehe <a href="#setbalances">Kontosalden festlegen</a>), 
		    handelt es sich um eine Vorhersage.</td>
	</tr>
	<tr>
		<td>Offene Posten</td>
		<td>Die Summe der noch offenen Positionen. Der Wert reflektiert die noch zu erwartenden tats&auml;chlichen Buchungen in diesem Monat.</td>
	</tr>
	<tr>
		<td>G/V relativ</td>
		<td>Die Gewinn- und Verlustrechnung f&uuml;r den Monat. Solange der Monat nicht abgeschlossen ist 
		    (siehe <a href="#setbalances">Kontosalden festlegen</a>), handelt es sich um eine Vorhersage.</td>
	</tr>
	<tr>
		<td>G/V absolut</td>
		<td>Die Differenz zu Ihrere individuellen <a href="../settings/history.html#threshold">Gewinn/Verlust-Schwelle</a>. Solange der Monat nicht abgeschlossen ist 
		    (siehe <a href="#setbalances">Kontosalden festlegen</a>), handelt es sich um eine Vorhersage.</td>
	</tr>
	<tr>
		<td>Ausgaben Soll</td>
		<td>Die Summe aller geplanten Ausgaben.</td>
	</tr>
	<tr>
		<td>Einnahmen Soll</td>
		<td>Die Summe aller geplanten Einnahmen.</td>
	</tr>
	<tr>
		<td>G/V Soll</td>
		<td>Die Gewinn- und Verlustrechnung, wie sie geplant wurde.</td>
	</tr>
	<tr>
		<td>Ausgaben Ist</td>
		<td>Die Summe aller bisher get&auml;tigten Ausgaben.</td>
	</tr>
	<tr>
		<td>Einnahmen Ist</td>
		<td>Die Summe aller tats&auml;chlichen Einnahmen.</td>
	</tr>
	<tr>
		<td>G/V Ist</td>
		<td>Die Gewinn- und Verlustrechnung, wie sie bisher ausf&auml;llt.</td>
	</tr>
</table>
<h3 id="plan">Die Buchungstabelle</h3>
<p>Die Buchungstabelle zeigt alle geplanten und get&auml;tigten Buchungen und Budgets. Ein t&uuml;rkiser Hintergrund hebt Budgets hervor.
Ein wei&szlig;er Hintergrund kennzeichnet einzelne Buchungen. Die folgende Tabelle beschreibt die verschiedenen Werte
in den jeweiligen Spalten.</p>
<table>
	<tr>
		<th>Spalte</th>
		<th>Beschreibung</th>
	<tr>
	<tr>
		<td>Datum</td>
		<td>Das datum, an dem die Buchung durchgef&uuml;hrt wurde. Das Feld ist nur bei get&auml;tigten Buchungen gesetzt.</td>
	</tr>
	<tr>
		<td>Text</td>
		<td>Der Buchungstext</td>
	</tr>
	<tr>
		<td>Details</td>
		<td>Details und Hinweise zu dieser Buchung, z.B. Herkunft oder Referenz (optional).</td>
	</tr>
	<tr>
		<td>Budget</td>
		<td>Das Budget, zu dem diese Buchung geh&ouml;rt (optional).</td>
	</tr>
	<tr>
		<td>Kategorie</td>
		<td>Die Kategorie, die dieser Buchung zugeordnet ist.</td>
	</tr>
	<tr>
		<td>Soll</td>
		<td>Der geplante Wert.</td>
	</tr>
	<tr>
		<td>Ist</td>
		<td>Der Ist-Wert. Dieser Wert stellt das verbrauchte Budgets dar, wenn es sich um eine Budgetzeile handelt.</td>
	</tr>
</table>

<h2 id="tasks">Aufgaben</h2>
<h3 id="selectmonth">Einen Monat ausw&auml;hlen</h3>
<p><em>RsBudget</em> opens the current month by default. You can select another month by navigating with the links
on top of the Summary Section.</p>
<ul>
	<li>Click the name of the months in order to select the month of the same year.</li>
	<li>Click <img src="../../images/go-first.png"/> to select the same month of the previous year.</li>
	<li>Click <img src="../../images/go-previous.png"/> to select the previous month.</li>
	<li>Click <img src="../../images/go-next.png"/> to select the next month.</li>
	<li>Click <img src="../../images/go-last.png"/> to select the same month of the next year.</li>
	 
</ul>

<h3 id="createplan">Den Monatsplan anlegen</h3>
<p>You'll need to create the plan for the month before you can start tracking. Click <img src="../../images/money--plus.png"/> at the
view's toolbar. The plan will be created from the <a href="../generalPlanning/index.html">General Plan</a>.</p>

<p>You can delete a plan by clicking on <img src="../../images/money--minus.png"/> at the view's toolbar.</p>

<h3 id="createtx">Eine neue Buchung anlegen</h3>
<p>Erzeugen Sie eine neue Buchung, indem Sie</p>
<ul>
	<li>mit der rechten Maustaste auf die Tabelle klicken. W&auml;hlen Sie "Neue Buchung" aus dem Kontextmen&uuml;.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-insert-row.png"/> direkt &uuml;ber der Buchungstabelle.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-insert-row.png"/> in der Werzeugleiste der Ansicht.</li>
	<li>Dr&uuml;cken Sie die <code>Einf&uuml;gen</code>-Taste</li>
</ul>
<p>Alle Methoden erzeugen eine neue Buchung am Ende der Tabelle und scrollen dorthin, falls notwendig. Die Textmarke (Cursor) ist bereits
im Feld f&uuml;r den Buchungstext platziert, so dass Sie sofort anfangen k&ouml;nnen, Ihren Text einzugeben.</p>

<h3 id="modifytx">Eine Buchung bearbeiten</h3>
<p>Doppelklicken Sie in der Tabelle auf den Wert, den Sie bearbeiten m&ouml;chten. Je nach Spalte erscheint ein Auswahlfeld, aus dem Sie
den neuen Wert selektieren k&ouml;nnen, bzw. ein Textfeld, mit dem Sie den Text &auml;ndern k&ouml;nnen. Dr&uuml;cken Sie <code>Enter</code>,
wenn Sie Ihre Eingabe beendet haben bzw. klicken Sie mit der Maus auf eine beliebige Stelle au&szlig;erhalb des Eingabefeldes. Ihre
&Auml;nderung wird sofort abgespeichert.</p>
<p>Sie k&ouml;nnen das Editieren abbrechen, wenn Sie <code>Esc</code> auf Ihrer Tastatur dr&uuml;cken. Ihr &Auml;nderung wird dann nicht abgespeichert.</p>

<h3 id="movetx">Eine Buchung verschieben</h3>
<p>Es ist m&ouml;glich, die Reihenfolge der Buchungen zu &auml;ndern. Klicken Sie dazu mit der rechten Maustaste auf die Tabelle und
w&auml;hlen Sie "Nach oben" bzw. "Nach unten", um die ausgew&auml;hlte Buchung zu verschieben. Dieselbe Aktion k&ouml;nnen Sie
auch &uuml;ber die Tastenkombinationen <code>Strg+&uarr;</code> und <code>Strg+&darr;</code> ausl&ouml;sen.</p>

<h3 id="sorttx">Buchungen sortieren</h3>
<p>All transactions can be sorted according to their actual transaction date by clicking the <img src="../../images/sort_ascend_16x16.png"/>
button in the view's toolbar. Planned transactions will be added to the bottom of the table, keeping the previous order of these
transactions. Budgets are always at the top of the table.</p>

<h3 id="transformtx">Buchungen in Budgets umwandeln</h3>
<p>Transaktionen k&ouml;nnen in Buchungen und umgekehrt umgewandelt werden. Klicken Sie dazu mit der rechten Maustaste auf die entsprechende
Zeile und w&auml;hlen Sie "In Budget umwandeln" bzw. "In Buchung umwandeln".</p>

<h3 id="deletetx">Eine Buchung l&ouml;schen</h3>
<p>Nat&uuml;rlich k&ouml;nnen Sie Buchungen und Budgets aus der Tabelle auch wieder l&ouml;schen. Handelt es sich bei der zu l&ouml;schenden
Buchung um eine bereits get&auml;tigte Buchung (Ist-Wert gesetzt), so wird die Buchung zun&auml;chst r&uuml;ckg&auml;ngig gemacht, so dass
nur der Soll-Wert stehen bleibt (geplante Buchung). Falls die Buchung noch nicht get&auml;tigt wurde (kein Ist-Wert), dann wird
die selektierte Buchung gelöscht. Nehmen Sie die L&ouml;schung vor, indem Sie</p>
<ul>
	<li>mit der rechten Maustaste auf die Tabelle klicken. W&auml;hlen Sie "Buchung l&ouml;schen" aus dem Kontextmen&uuml;.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-delete-row.png"/> direkt &uuml;ber der Buchungstabelle.</li>
	<li>Klicken Sie auf die Schaltfl&auml;che <img src="../../images/table-delete-row.png"/> in der Werzeugleiste der Ansicht.</li>
	<li>Dr&uuml;cken Sie die <code>Entfernen</code>-Taste</li>
</ul>
<p><em>RsBudget</em> wird Sie nach einer Best&auml;tigung fragen, bevor die ausgew&auml;hlte Zeile gel&ouml;scht wird.</p>

<h3 id="setbalances">Kontosalden festlegen</h3>
<p>The Opening and Closing Balance of a month is kept separately. You need to define them when starting respectively finalizing the
month. Click the <img src="../../images/book-brown.png"/> button from the the view's toolbar. A separate dialog will appear.</p>

<p><img src="../../images/de/balances-dialog.png"/></p>

<p>The specific options vary depending on your current plan and situation. The left side defines the Opening Balance, the right side of
the dialog defines the Closing Balance. You can either select a balance proposed or manually enter a specific amount for each of them. Click
"OK" when you finished your input, or abort with "Cancel".</p> 
</body>
</html>