<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Konto-Einstellungen</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt; <a href="index.html">Einstellungen</a> &gt;
<h1>Konto-Einstellungen</h1>
<p style="float:clear;">Dieser Reiter listet die Bankkonten f&uuml;r ihre <em>RsBudget</em>-Installation auf. Sie
k&ouml;nnen beliebige Konten anlegen, ver&auml;ndern oder auch wieder l&ouml,schen.</p>
<p>Bankkonten haben derzeit keine tiefere Bedeutung f&uuml;r das Programm. Sie k&ouml;nnen also ein
fiktives Konto eintragen. Jede buchung muss jedoch mit einem Konto verkn&uuml;pft sein, um zuk&uuml;nftige
Erweiterungen zu erm&ouml;glichen, z.B. um Buchungen per HBCI von Ihrer Bank automatisch abzufragen.</p>

<p><a href="../../images/de/settings-account.png"><img class="screenshot" border="no" src="../../images/de/settings-account.png" width="500"/></a></p>

<h2 id="create">Konto anlegen</h2>
<p>Klicken Sie auf "Neues Konto anlegen". Dadurch wird ein neuer Eintrag erzeugt und zur Bearbeitung selektiert. Die weitere Bearbeitung
ist identisch zum <a href="#change">Konto &auml;ndern</a>.</p>

<h2 id="change">Konto &auml;ndern</h2>
<p>Die folgenden Eigenschaften eines Kontos k&ouml;nnen festgelegt werden:</p>
<table>
<tr>
	<th>Eigenschaft</th>
	<th>Beschreibung</th>
</tr>
<tr>
	<td>Name</td>
	<td>Jedes Konto wird durch einen Namen identifiziert. Benutzen Sie einen sprechenden Namen f&uuml;r Ihr Konto.</td>
</tr>
<tr>
	<td>Kontoinhaber</td>
	<td>Der Inhaber des jeweiligen Kontos. In den meisten F&auml;llen wird das Ihr eigener Name sein.</td>
</tr>
<tr>
	<td>Kontonummer</td>
	<td>Die Kontonummer bei der Bank.</td>
</tr>
<tr>
	<td>BLZ</td>
	<td>Die Bankleitzahl. W&auml;hlen Sie einfach Ihre Bank aus. Falls Ihre Bank nicht aufgef&uuml;hrt ist (da nur deutsche
	    Banken gelistet sind), w&auml;hlen Sie einfach eine beliebige Bank aus.</td>
</tr>
<tr>
	<td>Default</td>
	<td>Dieses Flag markiert das Konto als Standard-Konto. <em>RsBudget</em> assoziiert alle Buchungen automatisch 
	    mit diesem Konto. F&uuml;r individuelle Buchungen kann das assoziierte Konto dann ver&auml;ndert werden.</td>
</tr>
<tr>
	<td>Planungsrelevant</td>
	<td>Dieses Konto wird bei der Planung ber&uuml;cksichtigt. Wenn Sie dieses Flag l&ouml;schen, wird das
	    Konto nicht mehr f&uuml;r statistische oder andere Zwecke ber&uuml;cksichtigt. (z.B. bei Aktiendepots).</td>
</tr>	
</table>

<h2 id="delete">Konto l&ouml;schen</h2>
<p>Klicken Sie auf "Konto l&ouml;schen". <em>RsBudget</em> wird Sie nach einer Best&auml;tigung fragen und das Konto
dann aus der Liste l&ouml;schen. Das Konto wird jedoch nicht physisch aus der Datenbank gel&ouml;scht, sondern
lediglich als inaktiv gekennzeichnet. Sie k&ouml;nnen die L&ouml;schung r&uuml;ckg&auml;ngig machen, wenn Sie
den Dialog mit "Cancel" abbrechen. Nur wenn Sie den Einstellungs-Dialog mit "OK" best&auml;tigen, wird die
Deaktivierung des Kontos auch vollzogen. Derzeit gibt es keine M&ouml;glichkeit, ein deaktiviertes Konto
wieder zu reaktivieren (Teil einer zuk&uuml;nftigen Erweiterung).</p>
<hr/>
<p style="text-align: left; float:left;">Vorherige Seite:<br/><a href="network.html">Netzwerk</a></p>
<p style="text-align: right; float:right;">N&auml;chste Seite:<br/><a href="rules.html">Regeln</a></p>
  
</body>
</html>