<html>
<head>
<link rel="stylesheet" type="text/css" href="../../style/style.css">
<title>Allgemeine Planung</title>
</head>
<body>
<a href="../index.html">Benutzerhandbuch</a> &gt;

<h1>Allgemeine Planung</h1>
<p>Die Allgemeine Planung legt fest, welche Transaktionen und Budgets in den einzelnen Monaten eines Jahres geplant
werden. Sie k&ouml;nnen sich diese Planung als eine Art Vorlage vorstellen. Diese Vorlage wird dann f&uuml;r die
Planung jedes einzelnen Monats verwendet. Jeder Monat stellt also eine konkrete Instanz dieser Vorlage dar. Die
<a href="../monthlyPlanning/index.html">Ein- und Ausgabenkontrolle</a> geschieht dann anhand dieser konkreten Instanz.</p>
<p>Die Planungsvorlage kann jederzeit ge&auml;ndert werden. Die bereits existierenden Monatspl&auml;ne werden
dadurch nicht beeinflusst. Die Vorlage wird nur zum Zeitpunkt der Erstellung des Monatsplans verwendet.</p>

<p><a href="../../images/de/views-general.png"><img class="screenshot" border="no" src="../../images/de/views-general.png" width="500"/></a></p>
<p><a href="../views/general-planning.html">Eine vollst&auml;ndige Beschreibung der Ansicht findet sich hier.</a></p>

<h2 id="createtx">Eine Transaktion anlegen</h2>
<p>Dr&uuml;cken Sie die <code>Einf&uuml;gen</code>-Taste, um eine neue Zeile zu erstellen. Das System wird die neue Zeile am
Ende der Tabelle hinzuf&uuml;gen und ggf. die Ansicht dorthin scrollen. Der Cursor ist in der Text-Spalte der neuen Transaktion
platziert. Sie k&ouml;nnen sofort mit dem Eingeben eines Namens beginnen. Dr&uuml;cken Sie die <code>Tab</code>-Taste
oder doppelklicken Sie auf das Soll-Feld, um den entsprechenden Planwert der Transaktion anzugeben. Ausgaben werden
durch negative Zahlen repr&auml;sentiert, Einnahmen durch positive Werte. Geben Sie also "-10" ein, wenn Sie Ausgaben in
H&ouml;he von 10 Euro angeben wollen.</p>
<p>Das soeben beschriebene Szenario hat nun eine monatlich auftretende Transaktion erzeugt. Das hei&szlig;t, dass <em>RsBudget</em>
eine entsprechende Transaktion in jedem einzelnen Monatsplan erzeugen wird.</p>

<h2 id="changecycle">Die Periodizit&auml;t &auml;ndern</h2>
<p>Einige Transaktionen werden jedoch nicht jeden Monat ben&ouml;tigt, sondern nur viertelj&auml;hrlich oder einmal im Jahr. Sie
k&ouml;nnen diese Eigenschaft festlegen, wenn Sie auf die Zyklus-Spalte doppelklicken. Diese enth&auml;lt als Voreinstellung den
Wert "monatlich". &Auml;ndern Sie den Zyklus wie gew&uuml;nscht ab.</p>
<p>Transaktionen, die nicht monatlich auftreten, ben&ouml;tigen eine weitere Informationen: n&auml;mlich, in welchen Monaten
sie geplant werden sollen. Je nach Zyklus k&ouml;nnen die Optionen variieren. Die aktuelle "Sequenz" ist in der entsprechenden
Spalte aufgef&uuml;hrt. Doppelklicken Sie dieses Feld, um den Wert abzu&auml;ndern.</p>

<h2 id="assigncategory">Eine Kategorie zuweisen</h2>
<p>Neue Transaktionen werden automatisch der Standard-Kategorie zugewiesen. &Auml;ndern Sie die Kategorie ab, indem Sie auf das
entsprechende Feld doppelklicken und die Kategorie ausw&auml;hlen. Die Auswahlm&ouml;glichkeiten selbst k&ouml;nnen in der
Ansicht <a href="../views/">Kategorien</a> ver&auml;ndert werden.</p>

<h2 id="createbudget">Ein Budget anlegen</h2>
<p>Ein Budget ist in der <em>RsBudget</em>-Terminologie eine Gruppe gleichartiger Transaktionen. Es wird benutzt, wenn man nicht
genau planen kann, wieviele solcher Transaktionen und in welcher Gesamth&ouml;he auftreten werden. "Lebensmittel" ist ein Beispiel
daf&uuml;r. Sie gehen vermutlich mehrmals im Monat einkaufen, m&ouml;chten aber insgesamt nicht mehr als 100 Euro daf&uuml;r
ausgeben. Anstatt mehrere Transaktionen auf Verdacht anzulegen, benutzen Sie ein Budget.</p>
<p>Ein Budget wird aus einer bereits existierenden Transaktion erzeugt. Der erste Schritt ist also, solch eine Transaktion zu erzeugen
(siehe oben). Als N&auml;chstes klicken Sie mit der rechten Maustaste auf diese Transaktion. Aus dem erscheinenden Kontextmen&uuml;
w&auml;hlen Sie "In Budget umwandeln" aus. <em>RsBudget</em> konvertiert die Transaktion nun in ein Budget und verschiebt es
an den Anfang der Tabelle (alle Budgets erscheinen ganz oben). Au&szlig;erdem wird das Budget mit t&uuml;rkis als Hintergrundfarbe
gekennzeichnet, so dass Sie Budgets schnell von gew&ouml;hnlichen Transaktionen unterscheiden k&ouml;nnen.</p>

<h2 id="assignbudget">Ein Budget zuweisen</h2>
<p>Obwohl es nicht sehr wahrscheinlich ist, dass vereinzelte Transaktionen einem Budget bereits in der Allgemeinen Planung
zugeordnet werden, kann man solche Transaktionen <b>innerhalb</b> von Budgets planen. Doppelklicken Sie auf die
Budget-Spalte der entsprechenden Transaktion und w&auml;hlen Sie das zugeh&ouml;rige Budget aus.</p>

<h2 id="order">Die Reihenfolge &auml;ndern</h2>
<p>Die Reihenfolge der Budgets und Transaktionen in der Vorlage kann &uuml;ber das Kontext-Men&uuml; (Rechtsklick mit der Maus)
oder durch Dr&uuml;cken der <code>Strg+&uarr;</code> und <code>Strg+&darr;</code> Tasten ver&auml;ndert werden. Diese Reihenfolge wird benutzt,
wenn <em>RsBudget</em> den konkreten Monatsplan erzeugt. Auf bereits existierende Monatspl&auml;ne hat auch diese &Auml;nderung
(wie alle anderen hier beschriebenen Aktionen) keinen Einfluss.</p>

<h2 id="deletetx">Eine Transaktion l&ouml;schen</h2>
<p>Eine Transaktion oder ein Budget wird gel&ouml;scht, indem man die jeweilige(n) Zeile(n) zun&auml;chst selektiert. Danach kann
die selektierte Zeile durch Dr&uuml;cken der <code>Entfernen</code>-Taste oder die Schaltfl&auml;che 
<img src="../../images/table-delete-row.png"/> gel&ouml;scht werden. Best&auml;tigen Sie den erscheinenden Dialog und die
Zeile wird aus der Tabelle entfernt.</p>
<p>Auf bereits existierende Monatspl&auml;ne hat diese &Auml;nderung keinen Einfluss.</p> 
</body>
</html>